#ifndef __INIT_H
#define __INIT_H

// Includes --------------------------------------------------------------------

// Typedef ---------------------------------------------------------------------

// Macro -----------------------------------------------------------------------
// #define VCO_MIN 0
#define VCO_MAX 200
#ifdef VCO_MIN
  #define VCO_OFFSET ((VCO_MAX + VCO_MIN) / 2)
  #define VCO_RANGE  (VCO_MAX - VCO_MIN)
#else
  #define VCO_OFFSET 1600  // смещение выходной пилы в м¬.
  #define VCO_RANGE  500   // размах выходной пилы в м¬.
// #define VCO_OFFSET 1000  // смещение выходной пилы в м¬.
// #define VCO_RANGE  1500  // размах выходной пилы в м¬.
#endif
// Variables -------------------------------------------------------------------

// Function prototypes ---------------------------------------------------------

// Inline Functions ------------------------------------------------------------

#endif
